// Пользователь вводит с клавиатуры M чисел. 
// Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

int GetRundom(int num)
{
    for (int i = 0; i <= num; i++)
    {  
        rundomNum = 
        
    }
}



Console.Clear();

System.Console.WriteLine("--> ");
int userNumber = Convert.ToInt32.(Console.ReadLine());
