// Звдача 21. Напишите программу, которая принимае на вход координаты
// двух точек в 2D пространстве.
// Например:
// A(3,6); B(2,1) --> 5,09
// A(7,5); B(1,-1) --> 7,21

Console.Clear;

System.Console.WriteLine("Введите число 1 --> ");
int a = int.Parse(Console.ReadLine()!);

System.Console.WriteLine("Введите число 2 --> ");
int b = int.Parse(Console.ReadLine()!);
